logs/average_benchmark_20250710_024851/benchmark_runs/run_03/h2_100ms_1pct.log
=== HTTP/2 BENCHMARK RESULTS ===
=== NETWORK CONDITIONS ===
Timestamp: 2025-07-10 02:32:41
Delay: 100ms
Loss: 1%
Router IP: 172.30.0.254
Server IP: 172.30.0.2
Current qdisc configuration:
qdisc netem 1: root refcnt 9 limit 1000 delay 150ms loss 1%
qdisc tbf 10: parent 1:1 rate 600Mbit burst 4050b lat 400ms 

=== CONNECTION ESTABLISHMENT PHASE ===
-t: warning: the number of threads is greater than hardware cores.
starting benchmark...
spawning thread #0: 5 total client(s). 1000 total requests
spawning thread #1: 5 total client(s). 1000 total requests
spawning thread #2: 5 total client(s). 1000 total requests
spawning thread #3: 5 total client(s). 1000 total requests
spawning thread #4: 5 total client(s). 1000 total requests
spawning thread #5: 5 total client(s). 1000 total requests
spawning thread #6: 5 total client(s). 1000 total requests
spawning thread #7: 5 total client(s). 1000 total requests
spawning thread #8: 5 total client(s). 1000 total requests
spawning thread #9: 5 total client(s). 1000 total requests
spawning thread #10: 5 total client(s). 1000 total requests
spawning thread #11: 5 total client(s). 1000 total requests
spawning thread #12: 5 total client(s). 1000 total requests
spawning thread #13: 5 total client(s). 1000 total requests
spawning thread #14: 5 total client(s). 1000 total requests
spawning thread #15: 5 total client(s). 1000 total requests
spawning thread #16: 5 total client(s). 1000 total requests
spawning thread #17: 5 total client(s). 1000 total requests
spawning thread #18: 5 total client(s). 1000 total requests
spawning thread #19: 5 total client(s). 1000 total requests
TLS Protocol: TLSv1.3
Cipher: TLS_AES_128_GCM_SHA256
Server Temp Key: X25519 253 bits
Application protocol: h2
progress: 10% done
progress: 20% done
progress: 30% done
progress: 40% done
progress: 50% done
progress: 60% done
progress: 70% done
progress: 80% done
progress: 90% done
progress: 100% done

finished in 292.29ms, 68424.96 req/s, 19.85MB/s
requests: 20000 total, 20000 started, 20000 done, 20000 succeeded, 0 failed, 0 errored, 0 timeout
status codes: 20000 2xx, 0 3xx, 0 4xx, 0 5xx
traffic: 5.80MB (6083616) total, 4.06MB (4258833) headers (space savings 27.82%), 1.14MB (1200000) data
                     min         max         mean         sd        +/- sd
time for request:    28.27ms     86.99ms     62.63ms     16.90ms    56.68%
time for connect:     3.91ms    137.21ms     70.71ms     42.06ms    56.00%
time to 1st byte:    32.24ms    216.83ms    130.01ms     60.14ms    55.00%
req/s           :     698.60     2642.53     1219.71      617.19    78.00%
Waiting 5s for connections to stabilize...
=== MEASUREMENT PHASE ===
-t: warning: the number of threads is greater than hardware cores.
starting benchmark...
spawning thread #0: 5 total client(s). 9000 total requests
spawning thread #1: 5 total client(s). 9000 total requests
spawning thread #2: 5 total client(s). 9000 total requests
spawning thread #3: 5 total client(s). 9000 total requests
spawning thread #4: 5 total client(s). 9000 total requests
spawning thread #5: 5 total client(s). 9000 total requests
spawning thread #6: 5 total client(s). 9000 total requests
spawning thread #7: 5 total client(s). 9000 total requests
spawning thread #8: 5 total client(s). 9000 total requests
spawning thread #9: 5 total client(s). 9000 total requests
spawning thread #10: 5 total client(s). 9000 total requests
spawning thread #11: 5 total client(s). 9000 total requests
spawning thread #12: 5 total client(s). 9000 total requests
spawning thread #13: 5 total client(s). 9000 total requests
spawning thread #14: 5 total client(s). 9000 total requests
spawning thread #15: 5 total client(s). 9000 total requests
spawning thread #16: 5 total client(s). 9000 total requests
spawning thread #17: 5 total client(s). 9000 total requests
spawning thread #18: 5 total client(s). 9000 total requests
spawning thread #19: 5 total client(s). 9000 total requests
TLS Protocol: TLSv1.3
Cipher: TLS_AES_128_GCM_SHA256
Server Temp Key: X25519 253 bits
Application protocol: h2
progress: 10% done
progress: 20% done
progress: 30% done
progress: 40% done
progress: 50% done
progress: 60% done
progress: 70% done
progress: 80% done
progress: 90% done
progress: 100% done

finished in 17.08s, 10541.41 req/s, 3.06MB/s
requests: 180000 total, 180000 started, 180000 done, 180000 succeeded, 0 failed, 0 errored, 0 timeout
status codes: 180000 2xx, 0 3xx, 0 4xx, 0 5xx
traffic: 52.24MB (54774601) total, 36.61MB (38389701) headers (space savings 27.80%), 10.30MB (10800000) data
                     min         max         mean         sd        +/- sd
time for request:      453us       1.88s    476.98ms    306.04ms    66.47%
time for connect:     4.04ms    100.04ms     51.11ms     27.41ms    57.00%
time to 1st byte:    36.88ms    887.90ms    416.20ms    263.08ms    59.00%
req/s           :     105.42      112.46      106.33        1.26    79.00%

=== BENCHMARK SUMMARY ===
Protocol: HTTP/2
Fair Comparison: Enabled
Warmup Requests: 20000
Measurement Requests: 180000
End Time: 2025-07-10 02:33:04
CSV Log: /logs/benchmark_20250710_022943/h2_100ms_1pct.csv